load-test.yml
config:
  target: '{{ $processEnvironment.API_TARGET }}'
  phases:
    - duration: 60
      arrivalRate: 10
    - duration: 120
      arrivalRate: 50
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: 'Get live streams'
    weight: 70
    requests:
      - get:
          url: '/api/v1/streams?status=live'

  - name: 'User login'
    weight: 30
    requests:
      - post:
          url: '/api/v1/auth/login'
          json:
            email: '{{ $processEnvironment.LOADTEST_EMAIL }}'
            password: '{{ $processEnvironment.LOADTEST_PASSWORD }}'